# TASK_1 ; DATA CLEANING AND PREPROCESSING

## MALL CUSTOMER SEGMENTAION DATA SETS

In [37]:
## IMPORT LIBRARIES 
import pandas as pd

In [38]:
## import data 

mall_data  = pd.read_csv("Mall_Customers.csv")

In [39]:
## show first 5 rows data

mall_data.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [40]:
## checking how many rows and columns in data 
mall_data.shape

(200, 5)

#### "The Mall Customer Segmentation dataset contains 200 rows and 5 columns."

In [41]:
## checking nulls in data 
mall_data.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

#### “This dataset has no null values.”

In [42]:
### checking duplicates 
mall_data.duplicated().sum()

0

### "There are no duplicates in this datasets"

In [43]:
### checking data format using .info()
mall_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [44]:
## separately show only integer and categorial  type columns
int_column = mall_data.select_dtypes(include = "int")

In [45]:
# integers column
int_column.head()

   CustomerID  Age  Annual Income (k$)  Spending Score (1-100)
0           1   19                  15                      39
1           2   21                  15                      81
2           3   20                  16                       6
3           4   23                  16                      77
4           5   31                  17                      40

In [46]:
# categorial columns
cat_column = mall_data.select_dtypes(include = "object")
cat_column.head()

   Gender
0    Male
1    Male
2  Female
3  Female
4  Female

## Then Save Cleaned Data